; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v12 ?v7)
             (pred_9 ?v3 ?v2)
             (pred_3 ?v12 ?v2)
             (pred_10 ?v1 ?v12 )
	     (pred_4 ?v12)
             (pred_7 ?v5)
             (pred_1 ?v3)
             (pred_12 ?v2)
             (pred_5 ?v12)
             (pred_8 ?v3)
             (pred_11 ?v12)
             (pred_6 ))



(:action op_3
:parameters (?v10 ?v8 ?v13 ?v11)
:precondition (and (pred_7 ?v10) (pred_7 ?v8) (pred_1 ?v13) (pred_12 ?v11)
          (pred_2 ?v10 ?v8) (pred_9 ?v13 ?v11)
                   (pred_3 ?v8 ?v11) (pred_4 ?v10) 
                   (pred_5 ?v8) (pred_8 ?v13))
:effect (and  (pred_11 ?v8) (not (pred_5 ?v8))))


(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_7 ?v10) (pred_7 ?v4)
               (pred_4 ?v10) (pred_2 ?v10 ?v4) (pred_11 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v10))))

(:action op_4
:parameters (?v10 ?v13)
:precondition (and (pred_7 ?v10) (pred_1 ?v13) 
                  (pred_4 ?v10) (pred_10 ?v13 ?v10) (pred_6 ))
:effect (and (pred_8 ?v13)
   (not (pred_10 ?v13 ?v10)) (not (pred_6 ))))


(:action op_5
:parameters (?v10 ?v9 ?v6)
:precondition (and (pred_7 ?v10) (pred_1 ?v9) (pred_1 ?v6)
                  (pred_4 ?v10) (pred_8 ?v6) (pred_10 ?v9 ?v10))
:effect (and (pred_8 ?v9) (pred_10 ?v6 ?v10)
        (not (pred_8 ?v6)) (not (pred_10 ?v9 ?v10))))

(:action op_2
:parameters (?v10 ?v13)
:precondition (and (pred_7 ?v10) (pred_1 ?v13) 
                  (pred_4 ?v10) (pred_8 ?v13))
:effect (and (pred_6 ) (pred_10 ?v13 ?v10) (not (pred_8 ?v13)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_15 obj_20 obj_22 obj_03 obj_18 obj_21 obj_17 obj_07 obj_08 obj_05 obj_14 obj_16 obj_06 obj_12 obj_09
    obj_10 obj_19 obj_04
    obj_11 obj_02 obj_01
    )

    (:init
       (pred_6)

       (pred_7 obj_13)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_22)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_7 obj_21)
       (pred_7 obj_17)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_14)
       (pred_7 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_19)
       (pred_12 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_01)

       (pred_2 obj_13 obj_03)
       (pred_2 obj_13 obj_15)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_22)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_22 obj_20)
       (pred_2 obj_03 obj_07)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_21)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_17)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_18)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_21)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_03)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_17)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_3  obj_21 obj_10)
       (pred_3  obj_08 obj_19)
       (pred_3  obj_05 obj_04)
       (pred_11 obj_13)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_22)
       (pred_11 obj_03)
       (pred_11 obj_18)
       (pred_11 obj_17)
       (pred_11 obj_07)
       (pred_11 obj_14)
       (pred_11 obj_16)
       (pred_11 obj_06)
       (pred_11 obj_12)
       (pred_11 obj_09)

       (pred_9  obj_11 obj_10)
       (pred_9  obj_02 obj_19)
       (pred_9  obj_01 obj_04)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_01 obj_18)
       (pred_4 obj_15)
    )

    (:goal (and
       (pred_10 obj_01 obj_22)
    ))
(:constraints
  (always (not (pred_4 obj_20)))
)
)

; plan
1. (op_4 obj_15 obj_11)
   deleted: (pred_10 obj_11 obj_15) (pred_6)
   added: (pred_8 obj_11)
   goals met: 0 of 1
2. (op_1 obj_15 obj_18)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_18)
   goals met: 0 of 1
3. (op_3 obj_18 obj_21 obj_11 obj_10)
   deleted: (pred_5 obj_21)
   added: (pred_11 obj_21)
   goals met: 0 of 1
4. (op_5 obj_18 obj_01 obj_11)
   deleted: (pred_8 obj_11) (pred_10 obj_01 obj_18)
   added: (pred_8 obj_01) (pred_10 obj_11 obj_18)
   goals met: 0 of 1
5. (op_1 obj_18 obj_21)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_21)
   goals met: 0 of 1
6. (op_1 obj_21 obj_17)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_22)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_22)
   goals met: 0 of 1
8. (op_2 obj_22 obj_01)
   deleted: (pred_8 obj_01)
   added: (pred_6) (pred_10 obj_01 obj_22)
   goals met: 1 of 1
